{
  "source_url": "https://losalamitospta.membershiptoolkit.com/home",
  "scraped_at": "2026-01-27T12:41:08.194058",
  "text": "Login\nHome\nPTA Info\nAbout the PTA\nPTA bylaws\nCommittees\nVolunteering\nSponsor\nCalendar\nMembership & Store\nWelcome to Los Alamitos Elementary School!\nThe Los Alamitos PTA is a non-profit volunteer organization that supports Los Alamitos Elementary School. Our PTA's goal is provide vital programs, supplies, financial support, and\npromote a collaborative relationship between parents, teachers, and administrators.\nJoin the PTA - have a voice in shaping how we support our kids, teachers, and school.\nRegistration\nWe are excited for the 2025-2026 school year to begin on August 7th!\nALL families need to update their personal information on the PTA website for their account to be active for the 2025-26 school year.\n*2025-26 PTA Membership is now open!\nPlease renew your membership\nhere\n.\nIf you do not have a Membership Toolkit account or are new to the school,\nplease register now and join the PTA:\n*An active account is required to receive the PTA's weekly email newsletter and access PTA store; and PTA membership is required to access the student directory, meeting minutes, and much more.\nJanuary 25, 2026\nAnnouncements\nPTA Meeting Tomorrow!\nWhen: Monday, January 26th right after Community Monday\nWhere: Cafeteria\nCome to the PTA meeting to hear what the PTA is up to and have a say! Find the agenda\nhere\n!\nSpelling Bee\nCongratulations to our finalists\nfor earning a spot in the next round! What an accomplishment! Please come out and cheer them on\nTomorrow, January 26th\nat 6:00 PM\nat the\nLos Alamitos Spelling Bee.\nLet’s show up strong and support our students!\nShawn Harris is Coming to Los Alamitos!\nThe PTA is hosting author\nShawn Harris\nfor an assembly for our students on\nJanuary 27th\nfor the release of:\nLet’s Be Bees\nThe only thing better than playing make believe is playing make believe with your favorite grown-up! Especially when that grown-up’s imagination is as big as yours, and you both get to make all kinds of funny sounds.\nShawn Harris is an award-winning creator of books for kids. He received a Caldecott Honor for his debut authored book Have You Ever Seen a Flower, which the New York Times called a “stunning tour de force.” His work as an illustrator includes What Can a Citizen Do?, Her Right Foot, and the Newbery Medal-winning bestseller The Eyes and the Impossible, all written by Dave Eggers; A Polar Bear in the Snow by Mac Barnett; and Everyone’s Awake by Colin Meloy, among others.\nTK-2 grade assemblies will focus on Let's Be Bees and 3-5 grade assemblies will focus on The First Cat in Space series!\nOrder your very own book signed by Shawn Harris! The deadline to order books is tomorrow, Monday Jan 19th!\nBooks will be delivered to Los Alamitos. You can purchase books by Shawn Harris at:\nhicklebees.com/shawnharris-\nlosalamitos\nBubblefest Update\nBubblefest takes place this\nFriday, January 30\nin the cafeteria. There is less than a week before the big day, and we still need more volunteers to sign up. We especially need help setting up after school Thursday and cleaning up after the event on Friday right after school. Here’s the sign-up link:\nhttps://signup.com/go/AHeWeDU\n. Thank you to everyone who has already signed up to help.\nI also want to thank Anjana Ramamurthi and Sadie Fenton for volunteering to take over as the Bubblefest coordinators next year. We really appreciate you keeping Bubblefest alive!\nFour Seasons Fundraising Concert at Castillero\nOur community is invited to attend the\nFour Seasons Fundraising Concert\non\nFriday, January 30, 2026, at 7:30 PM\nat\nVenture Church\n.\nThe concert will feature the\nCastillero Middle School Orchestras\n, showcasing a high-quality program of classical and contemporary music. Many of our elementary students continue on to Castillero, and this is a great opportunity for families to see the excellent music program they may join in the future.\nGuest performers will include\ntwo-time Grammy-winning jazz violinist Mads Tolling\n.\nPlease see the attached flyer for additional details, including time, location, and QR code.\nFamilies who are unable to attend but wish to support the program may donate using the information provided.\nHope to see you there,\nThe Castillero Middle school\nGalentine's Night Out at F45 Branham Park!\n45 minutes of strength training work out followed by bubbles\nEach F45 workout is a unique program that incorporates cardio, resistance- based strength training, or a hybrid of both, all geared toward everyday life. No two workouts are the same, keeping members challenged and having fun. All of the F45 coaches are certified personal trainers who have the skills to safely modify each movement to any member’s individual needs. Our goal is to help you become your fittest, strongest and healthiest self!\nThis is a free event on 2/12 with a maximum of 30 people, so sign up now!\nTo sign up, text \"LAMOMS\" to 408.549.7760\nYearbook Cover Contest (5th Graders Only)\n(Entries due by February 23, 2026)\nLos Alamitos PTA is inviting all Los Alamitos 5th graders to enter their drawings in our Yearbook cover contest. 2 winners will be selected to be displayed on the front and back cover, by the Yearbook committee panel.\nSubmit art on\n:\n• 8.5 X 11 sheet of white paper\n• Use the paper vertically\nAll entries must include:\n• Theme: Under the Sea\n• The words “Los Alamitos”\n• School Year: 2025-2026\nTips for good entry\n:\n• Not a lot of white space- lots of color (including background)\n• Mix up your medium (crayons, watercolors, markers, oil pastels etc)\n• Use up the whole sheet of paper (the bigger the better)\n• Do not put your name/grade/teacher on the drawing\nQuestions? E-mail:\nLosAlamitosPTA@gmail.c\nom\nVariety Show – Volunteers & Important Info\nWe’re gearing up for our upcoming Variety Show on\nFriday, March 20th\nand need parent volunteers to help make it a success!\nVolunteer opportunities include:\nMCs (Hosts) - to introduce our talented students\nStage Hands - to assist performers\nAV Support - for sound and visual support\nConcession Organizer - to coordinate snacks and sales\nIn addition, we are also looking for a volunteer who can provide a digital keyboard for the event.\nPlease reach out to\nSara Buxton at\nsalpibuxton@gmail.com\nif interested in any of the above.\nTo Apply to the Variety Show:\nDo you have a talent to share?\nSing, Rap, Dance, Lip Sync, Magic, Musical Instrument, Cheer Performance, Skit, Monologue, Jump Rope, Yo Yo, Puppet show, Comedy Routine, Impressions, Mime, Martial Arts demo, Poetry, Baton twirling.\nCome show us what you’ve got!\nImportant Dates!\nAudition Videos: Due by Friday, March 6th, 2026\nDress Rehearsal: Thursday, March 19th, 2026 @ 4:00pm\nShow: Friday, March 20th, 2026 @ 4:00pm\nWhere: The Stage at Los Alamitos\nSIGN UP: To Sign Up, Use the Link\nHERE\nMath Kangaroo Competition is Coming to Los Alamitos!\nFollowing are the steps to register for the Math kangaroo competition.\n1. Go to\nMath Kangaroo registration\n2.Create an account if you are new user\n3. Click on the by invitation button on the left panel.\n4. Copy and paste this code in the field invitation.\nCODE : CASAN_J0017001@2026math\n5. Do not share this code with anyone. Limited spots available at our school.\nEvent Date: March 19,2025\nEvent Time: 2:30 - 3:45\nVenue: Library\nif you need any additional information please reach out Harini(\nharini.mouli@gmail.com\n)\nReading Lab Volunteers Needed!\nThe Reading Lab is a tutoring program for students who would benefit from extra help with fundamental reading skills.\nWe are looking for volunteers who can come in\nonce per week (Tuesday, Wednesday, or Thursday) from 12:45pm - 2:00pm\nduring the school year. Training for new tutors is provided!! Helping these new & growing readers is super fun and rewarding!\n***Volunteers must be registered with the district and approved by Los Alamitos.***\nIf you're interested in volunteering, please sign up here:\nhttps://forms.gle/FqpLea77Sxjt\nwJTR9\nFor questions, please contact Chris Chen at\ncchris@sbcglobal.net\nor 408-981-2080 (mobile - please leave a message the first time), or you can find out more information about the program\nhere\n.\nYearbook Orders\nIt’s that time of year!\nOrder your 2025–26 Yearbook today and save all the memories.\nLast day to order: 4/20 — but don’t wait until the last minute! We won’t have extras on hand if you forget to order.\n5th grade parents — start gathering those adorable baby photos for the 5th Grade Baby Pages! They are due by\nMarch 1st!\nPlease send them to your classroom parent yearbook rep and include your child's full name with the photo.\nhttps://www.betteryearbook.com\n/\nNew Kiln!\nWe have a new kiln for our Art Vistas Program and we are so excited for many more art projects!!\nMiddle School Selection Process\n5th grade parents, you should have received this information through Parent Square, but here is a friendly reminder about middle school selection:\nHow to Submit School Choices\nFamilies will submit school choice requests online through the School Choice section of Parent Portal, which will be open from January 20 through February 13, 2026. An active Parent Portal account is required.\nIf you do not yet have a Parent Portal account, please visit the link below for instructions on setting up your account:\nhttps://www.sjusd.\norg/resources/parent-\nresources/parent-portal\nIf you experience technical issues or have questions after reviewing the training materials, please contact\nparentportal@sjusd.org\nor call (408) 535-6000 ext. 17490. Please note that an email address is required to create a Parent Portal account.\nSponsor Spotlight\nWe are so grateful to our generous sponsors whose support helps make our PTA programs and events possible. Your contributions strengthen our school community and create lasting experiences for our students. Thank you for investing in our kids and in Los Alamitos!\nSteinhoff Orthodontics\nStraight smiles start here! Steinhoff Orthodontics delivers expert, personalized care for kids and adults alike - from braces to clear aligners. Their friendly team makes every visit comfortable and confidence-boosting. Support a local practice that’s helping our kids smile brighter every day!\nWebsite:\nhttps://www.\nsteinhoffortho.com/\nUpcoming Events\nMonday, January 26\n8:15a General PTA Meeting\nTuesday, January 27\n6:00p Spelling Bee Finals\nFriday, January 30\n9:00a Bubblefest\nFriday, February 6\n6:00p Father Daughter Dance\nSaturday, February 7\n6:00p Mother Son Dance\nFind all PTA / school events / reminders on the MTK\nCalendar\nDownload the Membership Toolkit App (\niOS\n,\nAndroid\n) OR bookmark this site\nFor all news & information about the PTA, key dates for programs & events, membership info, etc.\nlogin\n|\nhome\n×\ndismiss\nTuesday January 27, 2026 12:41 pm (America / Los Angeles) 76.102.5.105 production4"
}